const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21',()=> {
  expect(sum(20,1)).toBe(21);
});

// 2 + 5 เท่ากับ ?
test('2+5 เท่ากับ ?',()=>{
  expect(sum(2,5)).toBe(7);
});

// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy

test('1+1 เท่ากับ 2 ',()=>{
  expect(sum(1,1)).toBe(2);
});

test('13+12 เท่ากับ',()=>{
  expect(sum(13,12)).toBe(25);
});

test('99+99 เท่ากับ ',()=> {
  expect(sum(99,99)).toBe(198);
});
